Mathe/HA_01/HA_01_AlMaweri.org

#+TITLE: Analysis I und Lineare Algebra für Ingenieurwissenschaften \large @@latex: \\@@ Hausaufgabe 01 - Al-Maweri 13
#+AUTHOR: Daniel Geinets (453843), Christopher Neumann (409098), Dennis Schulze (458415)

#+LATEX_CLASS_OPTIONS: [a4paper, 11pt]

#+LATEX_HEADER: \usepackage{braket}

#+LATEX: \setcounter{secnumdepth}{0}

\pagebreak

* Aufgabe 2
** a)
\begin{align*}
    & 9x^4 + 12zyx^2 + 4z^2y^2 \\
    = & (3x^2 + 2yz)^2
\end{align*}

** b)
\begin{align*}
    & x^{-2} - 36y^6 \\
    = & (x^{-1} + 6y^3)(x^{-1} - 6y^3)
\end{align*}

** c)
\begin{align*}
    & y^{-2} - 2 + y^2 \\
    = & (y^{-1} - y)^2
\end{align*}

* Aufgabe 3
** a)
\begin{align*}
    & ( \set{x, y}  \times \set{blau, rot, gelb}) \setminus \set{(x, y, z), z, x, (y, rot), (x, blau, rot), (gelb, y)} \\
    =& (\set{x, y} \times \set{blau, rot, gelb}) \setminus \set{(y, rot)} \\
    =& \set{(x, blau), (x, rot), (x, gelb), (y, blau), (y, gelb)}
\end{align*}

** b)
\begin{align*}
    & [6, 11] \setminus ([4, 6] \setminus [5, 7]) \\
    =& [6, 11] \setminus [4, 5[ \\
    =& [6, 11]
\end{align*}

** c)
\begin{align*}
    & ([5, 10] \setminus [4, 6]) \setminus [5, 7] \\
    =& ]6, 10] \setminus [5, 7] \\
    =& ]7, 10]
\end{align*}

** d)
\begin{align*}
    & \set{x \in \mathbb{R} | x^6 > 1} \cap \set{x \in \mathbb{R} | x \leq 0} \\
    =& (\mathbb{R} \setminus [-1, 1]) \cap ]-\infty, 0] \\
    =& ]-\infty, -1[
\end{align*}

* Aufgabe 4
** a)
$$ \frac{3x}{x-5} < 2, x \neq 5 $$

Fall 1: $x - 5 > 0$ \Rightarrow $x > 5$

\begin{align*}
    \frac{3x}{x-5} &< 2 \\
    \Leftrightarrow 3x &< 2(x-5) \\
    \Leftrightarrow 3x &< 2x-10 \\
    \Leftrightarrow x &< -10
\end{align*}

Widerspruch zwischen $x < -10$ und $x > 5$.

Fall 2: $x - 5 < 0$ \Rightarrow $x < 5$

\begin{align*}
    \frac{3x}{x-5} &< 2 \\
    \Leftrightarrow 3x &> 2(x-5) \\
    \Leftrightarrow 3x &> 2x-10 \\
    \Leftrightarrow x &> -10 \\
\end{align*}

Damit gilt für die Lösungsmenge $L$

$$ L = ]-10, 5[ $$

\pagebreak

** b)
$$ \frac{x^2 - 1}{6x - 9} \geq 1, x \neq \frac{3}{2} $$

Fall 1: $6x - 9 > 0$ \Rightarrow $x > \frac{3}{2}$

\begin{align*}
     \frac{x^2 - 1}{6x - 9} &\geq 1 \\
    \Leftrightarrow x^2 - 1 &\geq 6x - 9 \\
    \Leftrightarrow x^2 - 6x + 8 &\geq 0 \\
    \Leftrightarrow (x - 2)(x - 4) &\geq 0 \\
\end{align*}

Subfall 1: $x - 2 \geq 0$ und $x - 4 \geq 0$ \Rightarrow $x \geq 4$ \\
Subfall 2: $x - 2 \leq 0$ und $x - 4 \leq 0$ \Rightarrow $x \leq 2$ \\
\\
Damit gilt für die Lösungsmenge $L_1$ dieses Falls

$$ L_1 = ]\frac{3}{2}, 2] \cup [4, \infty[ $$

Fall 2: $6x - 9 < 0$ \Rightarrow $x < \frac{3}{2}$

\begin{align*}
    \frac{x^2 - 1}{6x - 9} &\geq 1 \\
    \Leftrightarrow x^2 - 1 &\leq 6x - 9 \\
    \Leftrightarrow x^2 - 6x + 8 &\leq 0 \\
    \Leftrightarrow (x - 2)(x - 4) &\leq 0 \\
\end{align*}

Subfall 1:  $x - 2 \leq 0$ und $x - 4 \geq 0$ \Rightarrow $x \leq 2$ und $x \geq 4$ (Widerspruch) \\
Subfall 2:  $x - 2 \geq 0$ und $x - 4 \leq 0$ \Rightarrow $x \geq 2$ und $x \leq 4$ (Widerspruch zur Annahme) \\
\\
Damit gilt für die Lösungsmenge $L_2$ dieses Falls

$$ L_2 = \{\} $$

Dann gilt für die Lösungsmenge $L$

$$ L = ]\frac{3}{2}, 2] \cup [4, \infty[ $$

** c)
$$ |2x + 3| \leq 5x - 3 $$

Fall 1: $2x + 3 \geq 0$ \Rightarrow $x \geq \frac{-3}{2}$

\begin{align*}
    |2x + 3| &\leq 5x - 3 \\
    \Leftrightarrow 2x + 3 &\leq 5x - 3 \\
    \Leftrightarrow 6 &\leq 3x \\
    \Leftrightarrow 2 &\leq x \\
\end{align*}

Daraus folgt

$$ L_1 = [2, \infty[ $$

Fall 2:  $2x + 3 < 0$ \Rightarrow $x < \frac{-3}{2}$

\begin{align*}
    |2x + 3| &\leq 5x - 3 \\
    \Leftrightarrow -(2x + 3) &\leq 5x - 3 \\
    \Leftrightarrow -2x - 3 &\leq 5x - 3 \\
    \Leftrightarrow 0 &\leq 7x \\
    \Leftrightarrow 0 &\leq x \\
\end{align*}

Daraus folgt

$$ L_2 = \{\} $$

Damit gilt für die Lösungsmenge $L$

$$ L = L_1 \cup L_2 = [2, \infty[ $$

* Aufgabe 5
** a)
*** a
\begin{align*}
    \sum_{k = 4}^{7} 2(k - 3)^2
    =& \sum_{k = 1}^{4} 2k^2 \\
    = 2 + 8 + 18 + 32
    =& 60
\end{align*}

*** b
\begin{align*}
    \prod_{k = 0}^{3} k!
    =& 0! \cdot 1! \cdot 2! \cdot 3! \\
    = 1 \cdot 1 \cdot 2 \cdot 6
    =& 12
\end{align*}

** b)
*** a
\begin{align*}
    \sum_{k = 0}^{n} 2 \cdot 2^k
    =& 2 \sum_{k = 0}^{n} 2^k \\
    = 2 \cdot \frac{1 - 2^{n + 1}}{1 - 2}
    =& 2^{n + 2} - 2
\end{align*}

*** b
\begin{align*}
    \sum_{k = 0}^{n} (-\frac{1}{5})^k
    = \frac{1 - (-\frac{1}{5})^{n + 1}}{1 + \frac{1}{5}}
    = \frac{1 - (-\frac{1}{5})^{n + 1}}{\frac{6}{5}}
    = \frac{5 + (-\frac{1}{5})^n}{6}
\end{align*}
