Mathe/HA_01/HA_01_AlMaweri.tex
% Created 2020-11-18 Mi 12:13
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper, 11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{braket}
\author{Daniel Geinets (453843), Christopher Neumann (409098), Dennis Schulze (458415)}
\date{\today}
\title{Analysis I und Lineare Algebra für Ingenieurwissenschaften \large  \\ Hausaufgabe 01 - Al-Maweri 13}
\hypersetup{
 pdfauthor={Daniel Geinets (453843), Christopher Neumann (409098), Dennis Schulze (458415)},
 pdftitle={Analysis I und Lineare Algebra für Ingenieurwissenschaften \large  \\ Hausaufgabe 01 - Al-Maweri 13},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\setcounter{secnumdepth}{0}

\pagebreak

\section{Aufgabe 2}
\label{sec:orgbafe228}
\subsection{a)}
\label{sec:orgc9ca8e7}
\begin{align*}
    & 9x^4 + 12zyx^2 + 4z^2y^2 \\
    = & (3x^2 + 2yz)^2
\end{align*}

\subsection{b)}
\label{sec:org5e4db1b}
\begin{align*}
    & x^{-2} - 36y^6 \\
    = & (x^{-1} + 6y^3)(x^{-1} - 6y^3)
\end{align*}

\subsection{c)}
\label{sec:org4f2aeec}
\begin{align*}
    & y^{-2} - 2 + y^2 \\
    = & (y^{-1} - y)^2
\end{align*}

\section{Aufgabe 3}
\label{sec:org83c1b4e}
\subsection{a)}
\label{sec:org6a011db}
\begin{align*}
    & ( \set{x, y}  \times \set{blau, rot, gelb}) \setminus \set{(x, y, z), z, x, (y, rot), (x, blau, rot), (gelb, y)} \\
    =& (\set{x, y} \times \set{blau, rot, gelb}) \setminus \set{(y, rot)} \\
    =& \set{(x, blau), (x, rot), (x, gelb), (y, blau), (y, gelb)}
\end{align*}

\subsection{b)}
\label{sec:orgfd213fc}
\begin{align*}
    & [6, 11] \setminus ([4, 6] \setminus [5, 7]) \\
    =& [6, 11] \setminus [4, 5[ \\
    =& [6, 11]
\end{align*}

\subsection{c)}
\label{sec:orgaccedb2}
\begin{align*}
    & ([5, 10] \setminus [4, 6]) \setminus [5, 7] \\
    =& ]6, 10] \setminus [5, 7] \\
    =& ]7, 10]
\end{align*}

\subsection{d)}
\label{sec:org855194e}
\begin{align*}
    & \set{x \in \mathbb{R} | x^6 > 1} \cap \set{x \in \mathbb{R} | x \leq 0} \\
    =& (\mathbb{R} \setminus [-1, 1]) \cap ]-\infty, 0] \\
    =& ]-\infty, -1[
\end{align*}

\section{Aufgabe 4}
\label{sec:org53b89b5}
\subsection{a)}
\label{sec:org045dd62}
$$ \frac{3x}{x-5} < 2, x \neq 5 $$

Fall 1: \(x - 5 > 0\) \(\Rightarrow\) \(x > 5\)

\begin{align*}
    \frac{3x}{x-5} &< 2 \\
    \Leftrightarrow 3x &< 2(x-5) \\
    \Leftrightarrow 3x &< 2x-10 \\
    \Leftrightarrow x &< -10
\end{align*}

Widerspruch zwischen \(x < -10\) und \(x > 5\).

Fall 2: \(x - 5 < 0\) \(\Rightarrow\) \(x < 5\)

\begin{align*}
    \frac{3x}{x-5} &< 2 \\
    \Leftrightarrow 3x &> 2(x-5) \\
    \Leftrightarrow 3x &> 2x-10 \\
    \Leftrightarrow x &> -10 \\
\end{align*}

Damit gilt für die Lösungsmenge \(L\)

$$ L = ]-10, 5[ $$

\pagebreak

\subsection{b)}
\label{sec:org7e7d04a}
$$ \frac{x^2 - 1}{6x - 9} \geq 1, x \neq \frac{3}{2} $$

Fall 1: \(6x - 9 > 0\) \(\Rightarrow\) \(x > \frac{3}{2}\)

\begin{align*}
     \frac{x^2 - 1}{6x - 9} &\geq 1 \\
    \Leftrightarrow x^2 - 1 &\geq 6x - 9 \\
    \Leftrightarrow x^2 - 6x + 8 &\geq 0 \\
    \Leftrightarrow (x - 2)(x - 4) &\geq 0 \\
\end{align*}

Subfall 1: \(x - 2 \geq 0\) und \(x - 4 \geq 0\) \(\Rightarrow\) \(x \geq 4\) \\
Subfall 2: \(x - 2 \leq 0\) und \(x - 4 \leq 0\) \(\Rightarrow\) \(x \leq 2\) \\

Damit gilt für die Lösungsmenge \(L_1\) dieses Falls

$$ L_1 = ]\frac{3}{2}, 2] \cup [4, \infty[ $$

Fall 2: \(6x - 9 < 0\) \(\Rightarrow\) \(x < \frac{3}{2}\)

\begin{align*}
    \frac{x^2 - 1}{6x - 9} &\geq 1 \\
    \Leftrightarrow x^2 - 1 &\leq 6x - 9 \\
    \Leftrightarrow x^2 - 6x + 8 &\leq 0 \\
    \Leftrightarrow (x - 2)(x - 4) &\leq 0 \\
\end{align*}

Subfall 1:  \(x - 2 \leq 0\) und \(x - 4 \geq 0\) \(\Rightarrow\) \(x \leq 2\) und \(x \geq 4\) (Widerspruch) \\
Subfall 2:  \(x - 2 \geq 0\) und \(x - 4 \leq 0\) \(\Rightarrow\) \(x \geq 2\) und \(x \leq 4\) (Widerspruch zur Annahme) \\

Damit gilt für die Lösungsmenge \(L_2\) dieses Falls

$$ L_2 = \{\} $$

Dann gilt für die Lösungsmenge \(L\)

$$ L = ]\frac{3}{2}, 2] \cup [4, \infty[ $$

\subsection{c)}
\label{sec:orgfa86404}
$$ |2x + 3| \leq 5x - 3 $$

Fall 1: \(2x + 3 \geq 0\) \(\Rightarrow\) \(x \geq \frac{-3}{2}\)

\begin{align*}
    |2x + 3| &\leq 5x - 3 \\
    \Leftrightarrow 2x + 3 &\leq 5x - 3 \\
    \Leftrightarrow 6 &\leq 3x \\
    \Leftrightarrow 2 &\leq x \\
\end{align*}

Daraus folgt

$$ L_1 = [2, \infty[ $$

Fall 2:  \(2x + 3 < 0\) \(\Rightarrow\) \(x < \frac{-3}{2}\)

\begin{align*}
    |2x + 3| &\leq 5x - 3 \\
    \Leftrightarrow -(2x + 3) &\leq 5x - 3 \\
    \Leftrightarrow -2x - 3 &\leq 5x - 3 \\
    \Leftrightarrow 0 &\leq 7x \\
    \Leftrightarrow 0 &\leq x \\
\end{align*}

Daraus folgt

$$ L_2 = \{\} $$

Damit gilt für die Lösungsmenge \(L\)

$$ L = L_1 \cup L_2 = [2, \infty[ $$

\section{Aufgabe 5}
\label{sec:org1559469}
\subsection{a)}
\label{sec:org679372e}
\subsubsection{a}
\label{sec:org47db3c3}
\begin{align*}
    \sum_{k = 4}^{7} 2(k - 3)^2
    =& \sum_{k = 1}^{4} 2k^2 \\
    = 2 + 8 + 18 + 32
    =& 60
\end{align*}

\subsubsection{b}
\label{sec:orgbb12cfb}
\begin{align*}
    \prod_{k = 0}^{3} k!
    =& 0! \cdot 1! \cdot 2! \cdot 3! \\
    = 1 \cdot 1 \cdot 2 \cdot 6
    =& 12
\end{align*}

\subsection{b)}
\label{sec:orgbb34fdc}
\subsubsection{a}
\label{sec:org1d88373}
\begin{align*}
    \sum_{k = 0}^{n} 2 \cdot 2^k
    =& 2 \sum_{k = 0}^{n} 2^k \\
    = 2 \cdot \frac{1 - 2^{n + 1}}{1 - 2}
    =& 2^{n + 2} - 2
\end{align*}

\subsubsection{b}
\label{sec:org2808220}
\begin{align*}
    \sum_{k = 0}^{n} (-\frac{1}{5})^k
    = \frac{1 - (-\frac{1}{5})^{n + 1}}{1 + \frac{1}{5}}
    = \frac{1 - (-\frac{1}{5})^{n + 1}}{\frac{6}{5}}
    = \frac{5 + (-\frac{1}{5})^n}{6}
\end{align*}
\end{document}
